Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, None)]            0         
_________________________________________________________________
embedding (Embedding)        (None, None, 50)          235000    
_________________________________________________________________
bidirectional (Bidirectional (None, None, 64)          21248     
_________________________________________________________________
dropout (Dropout)            (None, None, 64)          0         
_________________________________________________________________
dense (Dense)                (None, None, 4)           260       
=================================================================
Total params: 256,508
Trainable params: 256,508
Non-trainable params: 0
_________________________________________________________________
