Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, None)]            0         
_________________________________________________________________
embedding (Embedding)        (None, None, 50)          258450    
_________________________________________________________________
bidirectional (Bidirectional (None, None, 64)          16128     
_________________________________________________________________
dropout (Dropout)            (None, None, 64)          0         
_________________________________________________________________
dense (Dense)                (None, None, 4)           260       
=================================================================
Total params: 274,838
Trainable params: 274,838
Non-trainable params: 0
_________________________________________________________________
